{
    "data": {
        "birth_date": "3rd of December, 1996",
        "bio": "",
        "hobbies": [
            {
                "title": "Basketball fanatic",
                "description": "Basketball has been one of my most loved activity throughout life. Before going to University, I was thinking about going to USA at University to <i>'live the American dream'</i>. Unfortunatelly, the time now does not allow me to pursue a regular trainings."
            },
            {
                "title": "Artist wanna-be",
                "description": "Since a very young age, I was attracted to capturing what I considered beautiful with a pencil on a piece of paper, but nowadays, due to the lack of practice, I am barely able to reproduce some of my old drawings and sketches."
            },
            {
                "title": "Book addict",
                "description": "Starting in highschool, my passion for books has grown roots. From 1-2 books owned (and read for anyone who thought I only buy them), I got to a full bookshelf containing multiple novels of fiction, from <i>The Divine Comedy</i>, to <i>Dan's Brown</i> collection, various <i>thrillers</i>, and more. Who thought that I will love reading? - Not me, that's for sure."
            },
            {
                "title": "Average youngster",
                "description": "I am not trying to sell you donuts here, and we all knew that this was coming. I'm young, it's clear that I enjoy partying, and living my life; in the end, it is the only one I am allowed, right?"
            }
        ]
    },
    
    "skills": [
        {
            "title": "Java",
            "level": 3.5
        },
        {
            "title": "JavaScript",
            "level": 3
        },
        {
            "title": "C",
            "level": 2
        },
        {
            "title": "C++",
            "level": 1.5
        },
        {
            "title": "HTML",
            "level": 3
        },
        {
            "title": "CSS",
            "level": 2.5
        },
        {
            "title": "APEX",
            "level": 4.5
        }
    ],
    
    "soft_skills": [
        {
            "title": "Time management",
            "level": 4
        },
        {
            "title": "Team management",
            "level": 4.5
        },
        {
            "title": "Leadership",
            "level": 4.5
        },
        {
            "title": "Problem solving",
            "level": 3.5
        },
        {
            "title": "Teamwork",
            "level": 3
        },
        {
            "title": "Dynamism",
            "level": 3.5
        },
        {
            "title": "Communication",
            "level": 4.5
        },
        {
            "title": "Open minded",
            "level": 3.5
        }
    ],
    
    "events":[
    {
        "title": "The Birth",
        "article_title": "The Birth",
        "date": "3rd of December, 1996",
        "description": "The winter of 1996 has brought the Birsasteanu family a great joy. Their new family member, Bogdan Andrei Alexandru, has been born. It was one of the greatest gifts that Sorin's wife, Camelia, could have gotten on her aniversary. She was just celebrating her 22nd birthday, when her baby got to see the light for the first time. That was the moment when Sorin and Camelia realised that their son will aim for the stars.",
        "hasAcc": false,
        "accs": []
    },
    
    {
        "title": "First steps",
        "article_title": "Kindergarden",
        "date": "the year of 1999",
        "description": "This was the beginning of Bogdan's education. It was the time he went to the first levels of school, crying as any other child, wishing he would not leave his parents. But, as time passed, and he started to play with other children of his age, he soon started to like it more and more; maybe he was starting to enjoy it? Or maybe a passion for learning was just catching wings? No one will ever know.",
        "hasAcc": false,
        "accs": []
    },
    
    {
        "title": "Leveled up!",
        "article_title": "Primary School",
        "date": "15th of September, 2003",
        "description": "It was the beginning of autumn, but the air was hot. There were so many people gathered in the tiny school courtyard, and he was feeling scared again; but there he met the one who will later become his best friend. The upcoming <i>eight</i> years consisted in a time of joy, childhood at its finest, and preparing for the <u>grand step</u>: <i>highschool</i>. Bogdan even managed to accomplish some extras along the way..",
        "hasAcc": true,
        "accs": [
            {
                "title": "Basketball",
                "date": "Sometime in 2005",
                "description": "At the knowledge that their son was willing to start football (the main sport at that time in his hometown), they proposed him what later became to be the love of his life: <i>Basketball</i>.",
                "awards": [
                    {
                        "title": "Basketball School Competitions",
                        "description": "Participated in multiple school competitions, usually getting to the city stage."
                    }
                ]
            },
            
            {
                "title": "Archimedes Mathematics Contests",
                "date": "2003 - 2011",
                "description": "The contest consisted in a series of mathematical problems of school level, and I managed to reach the city stage sometimes, but usually unable to pass the second stage.",
                "awards": []
            },
                    
            {
                "title": "The Kangaroo English Contests",
                "date": "2003 - 2011",
                "description": "Participated in multiple editions of the contest, usually getting to the city stage of the competition.",
                "awards": []
            },
                    
            {
                "title": "Multiple Olimpiads",
                "date": "2003 - 2011",
                "description": "The list contains competitions in Biology, Mathematics, and English school olimpiads.",
                "awards": []
            },
            
            {
                "title": "National Evaluation Exam",
                "date": "June, 2011",
                "description": "The National Evaluation Exam was the step that everyone was preparing during the school years; all the subjects learned during the eight years of school were pointing to the Mathematics, Romanian, and English exams at this point.",
                "awards": [
                    {
                        "title": "Mathematics: 10/10",
                        "description": ""
                    },
                    
                    {
                        "title": "Romanian: 10/10",
                        "description": ""
                    },
                    
                    {
                        "title": "English: 10/10",
                        "description": ""
                    }
                ]
            }
        ]
    },
    
    {
        "title": "Level H",
        "article_title": "Highschool",
        "date": "15th of September, 2011",
        "description": "The time passed, and most of his colleagues got to various highschools in Bucharest. Bogdan had an overall grade to go to other institutions, but he chose the 'Grigore Moisil' Highschool in Bucharest. Starting then, his life started to change. He was still playing basketball at a competition level, participating in both school, and external competitions such as the Streetball Contest. He was also starting to love Informatics (or maybe not really love it), the first year bringing him a top mark of 7 out of 10. But he felt a call for this subject, so in the upcoming years, he managed to raise to a minimum of 8 out of 10.",
        "hasAcc": true,
        "accs": [
            {
                "title": "Basketball again",
                "date": "2011 - 2015",
                "description": "Again, there were competitions that we (because there was the team that did all the work) managed to qualify in the top of the leaderboards, but there wew also times when we were not able to pass to the next stages.",
                "awards": []
            },
            {
                "title": "English Olympiads",
                "date": "2011 - 2015",
                "description": "There was the passion of learning English again, which pushed Bogdan to be the best. He also managed to take part in some competitions, but now, the main objective was to gain the Cambridge English Certificate.",
                "awards": []
            },
            
            {
                "title": "Certificates",
                "date": "2014 - 2015",
                "description": "During the school period, I was able to gain several certifications. The list includes:",
                "awards": [
                    {
                        "title": "ECDL Core Certificate",
                        "description": ""
                    },
                    
                    {
                        "title": "Database Design and Programming With SQL",
                        "description": ""
                    },
                    
                    {
                        "title": "Cambridge Advanced English Certificate",
                        "description": ""
                    }
                ]
            },
            
            {
                "title": "The 'Great Exam'",
                "date": "July, 2015",
                "description": "The so called <i>Bacalaureat</i> was the exam that every Romanian at least once thought in fear about. It consisted in a Romanian Language exam, a Mathematics exam, and, at choice, a Biology Exam, a Chemistry exam, and an Informatics exam. Let's make a quick recap: Bogdan had no proximity with Chemistry (actually he hated it), and Biology started to sound so much like an ancient language to him; so you probably got the exam that he picked.",
                "awards": [
                    {
                        "title": "Romanian: 9/10",
                        "description": ""
                    },
                    
                    {
                        "title": "Mathematics: 9.1/10",
                        "description": ""
                    },
                    
                    {
                        "title": "Informatics: 9.95/10",
                        "description": ""
                    }
                ]
            }
        ]
    },
    
    {
        "title": "Revelations",
        "article_title": "The Faculty of Mathematics and Informatics - the University of Buchares",
        "date": "1st of November, 2015 - June, 2017",
        "description": "As a fresh graduate of the 'Grigore Moisil' Highschool, Bogdan found himself required to make a choice that will draw his path in life: <i>he needed to pick a University out of the neverending list of institutions.</i> After arguing on selecting the Politehnica University (one of the best at that time), or aiming for a place in the University of Bucharest (another top qualified institution in his hometown), or settling for a place at the Academy of Economical Studies, he went for it, calling <i>all-in</i> for the so called 'Teacher Factory'; it was a common opinion that the University of Bucharest molds only teachers, although Bogdan knew that it was a misconception of the masses. It didn't take long though, taken into account his expectations regarding the 'Uni-life', and his slowly-but-surely loss of interest in learning what he considered unnecessary subjects, to change his mind after the first year as a student. In the second year, he felt like giving up, tasting the attraction to actual development (and not blunting the edges of books in search of a strange algorithm), which in the end resulted in ending his experience at the University of Bucharest, and search for something more suitable to him.",
        "hasAcc": true,
        "accs": [
            {
                "title": "More Basketball",
                "date": "2015 - 2016",
                "description": "Once again, the passion to Basketball prevailed, spending most of the time inside a gym, training, becoming better and better, and going to various competitions. '22 hours of training per week? Come at me, bro'!'",
                "awards": [
                    {
                        "title": "University Basketball Cup",
                        "description": ""
                    },
                    
                    {
                        "title": "University Streetball - ASMI Cup",
                        "description": ""
                    }
                ]
            },
            {
                "title": "ITFest Hackathon - ASE",
                "date": "November, 2015",
                "description": "Joining with two colleagues from University, the contest required the teams to develop a Web app in a 12h timeframe",
                "awards": [
                    {
                        "title": "Participation",
                        "description": "We were ill-prepared for the contest, with no former experience, but we managed to 'create' something, having a good time along the way."
                    }
                ]
            }
        ]
    },
    
    {
        "title": "career.start();",
        "article_title": "Gameloft SRL",
        "date": "June, 2016",
        "description": "During the first year of University, Bogdan felt like experiencing what really means to <u>work</u>; the subjects taught at school were of poor interest, and our main character in this story was willing to learn <i>something</i>. That was the reason of starting as a <b>QA Analyst Technician</b> at <b>Gameloft</b>. At first, it was quite nice, he was starting to understand the basic principles of programming, the cycles of app development, and most importantly, the life of an employee. But as time passed, and the job starting to become so exhaustingly repetitive, he refused to continue his contract.",
        "hasAcc": true,
        "accs": [
            {
                "title": "Gained Skills",
                "date": "June, 2016 - September, 2016",
                "description": "On the course of my employment at Gameloft, I started to gain valueble skills, and I have been provided with the opportunity of learning new assets. The skills that I was able to improve, or gain:",
                "awards": [
                    {
                        "title": "Teamwork",
                        "description": ""
                    },
                    
                    {
                        "title": "Bug tracking",
                        "description": ""
                    },
                    
                    {
                        "title": "Bug reporting",
                        "description": ""
                    },
                    
                    {
                        "title": "Time management",
                        "description": ""
                    }
                ]
            }
        ]
    },
    
    {
        "title": "career.upgrade();",
        "article_title": "Team Extension SRL",
        "date": "5th of December, 2016 - Present",
        "description": "After a phone call in late November, 2016, Bogdan realized that it's time he proves his aptitudes; a recruiter just phoned him, asking if he was still interested in joining their company for a paid Internship. Our becoming-hero was thrilled after the interview, preparing to start his career as a mobile developer at the beginning of December, the same year. It took him motivation, hardworking, quick thinking and trust to follow the path that was building in front of him, gradually raising from <i>trainee</i>, to <i>junior Android developer</i>, being asked to <i>manage</i> his junior colleagues, and finally changing the department to <i>Salesforce</i>, and starting to work as a <i>junior Salesforce developer</i>.",
        "hasAcc": true,
        "accs": [
            {
                "title": "Certifications",
                "date": "August, 2017",
                "description": "While working at Team Extension, I had the opportunity of gaining important assets, along with a certificate required to work for one of our clients:",
                "awards": [
                    {
                        "title":"Salesforce Platform Developer I",
                        "description": "Awarded for completing the Salesforce training provided by the company, and proving the ability of developing Salesforce solutions in APEX, Visualforce, and Lightning; the certificate has been awarded as a result of the Salesforce Platform Developer I exam"
                    }
                ]
            },
            {
                "title": "Skills",
                "date": "December, 2016 - Present",
                "description": "I was able to gain new skills and improve my capabilities while working here. Some of the skills that I managed to sharpen are:",
                "awards": [
                    {
                        "title": "Time management",
                        "description": "Grew a strong sense of establishing deadlines for my projects, and respecting them"
                    },
                    
                    {
                        "title": "Team management",
                        "description": "Built a strong sense of management regarding a team of 6-10 members, planning the next steps, asking for advice, and providing advice, when necessary, and establishing a working system for the best results"
                    },
                    
                    {
                        "title": "Leadership",
                        "description": "Managed to understand the difference between a manager and a leader, putting my team on the first place, and helping them as much as possible, aiming to help them learn instead of asking for the Heavens"
                    },
                    
                    {
                        "title": "Java programming",
                        "description": "Understood basic architectures and design patterns used in both the pure Java language, and the Android framework"
                    },
                    
                    {
                        "title": "JavaScript programming",
                        "description": "Sharpened my abilities in working with JS, using it in both Web apps and various Salesforce solutions"
                    },
                    
                    {
                        "title": "APEX programming",
                        "description": "Learned to develop multiple solutions in APEX regarding the Salesforce platform"
                    },
                    
                    {
                        "title": "HTML/CSS",
                        "description": "Increased my capabilities in working with HTML and CSS, building Visualforce web pages; added to this, expanded my knowledge in web development, starting to understand Bootstrap and working in a cleaner, resoonsive manner"
                    },
                    
                    {
                        "title": "MongoDB",
                        "description": "Started to learn about NoSQL databases and using them in personal projects, along with NodeJS"
                    }
                ]
            }
        ]
    },
    
    {
        "title": "Quick thinking",
        "article_title": "Faculty of Managerial Informatics - the Romanian-American University of Bucharest",
        "date": "1st of November, 2017 - Present",
        "description": "After losing interest in the lessons provided by his teachers at the previous University, Bogdan has decided that the best move to make would be changing the institution, try something different, something that would enable him to do what he first expected. That being considered, he moved to <i>RAU</i>.",
        "hasAcc": false,
        "accs": [
            
        ]
    },
        
    {
        "title": "The Legend",
        "article_title": "Current objectives",
        "date": "Sometime in the (hopefully) near future",
        "description": "Bogdan wishes to improve as a developer enough that he can work as a full-stack mobile developer. He always loved cryptography, and finding answers where there are none, and he is willing to also persuade this side of the IT field. Like any other archeologist, he wants to remove the sand that stands on the surface of security systems; <i>'find their weakpoints, strengths, and exploits, and come up with improved versions'</i>, he would say. He never thought about failing without return, so he hopes that at some point, when he will be prepared, he will become a <u>Legend</u> - maybe even greater that the well known Steven Jobs, Bill Gates, and all the others that had met success before him. In the end, he chose a field in full expansion and evolution.",
        "hasAcc": false,
        "accs": [
            
        ]
    }
],
    
    "experience": [
        {
            "role": "QA Analyst",
            "company": {
                "name": "Gameloft Romania SRL",
                "url": "http://www.gameloft.ro/",
                "period": "4 months",
                "logo": "gameloft-logo.png",
                "description": "<i>A leading digital and social game publisher, Gameloft® has established itself as one of the top innovators in its field since 2000. Gameloft creates games for all digital platforms and with an audience of 173 million monthly users offers via Gameloft Advertising Solutions a unique level of visibility and involvement to advertisers. Gameloft operates its own established franchises such as Asphalt®, Order & Chaos, Modern Combat and Dungeon Hunter and also partners with major rights holders including Universal, Illumination Entertainment, Disney®, Marvel®, Hasbro®, Fox Digital Entertainment, Mattel® and Ferrari®. Gameloft is present on all continents, distributes its games in over 100 countries and employs 5,000 developers.</i>"
            },
            "projects": [
                {
                    "title": "Multiple Applications",
                    "description": "During my employment at Gameloft, I have participated in testing sessions for multiple games, such as <i>Heroes of Order & Chaos (HOC)</i>, <i>UNO & Friends</i>, and <i>Asphalt Xtreme</i>."
                }
            ]
        },
        
        {
            "role": "Android Trainee",
            "company": {
                "name": "Team Extension SRL",
                "url": "https://www.teamextension.ro",
                "period": "4 months",
                "logo": "tx-logo-small.png",
                "description": "<i>Ready to take your business to new heights? <br/><br/>Hire the best developers, engineers, programmers, coders, and consultants in Romania. <br/>Fortune 500 and start-ups choose Team Extension's developers for their mission critical software projects.</i>"
            },
            "projects": [
                {
                    "title": "Various training applications",
                    "description": "We had to get used to creating responsive apps using the Android Studio and writing Java code. Taken this into account, it was mandatory that we build as many little applications as possible such as: a Calculator App, a Geolocator of the office, and a Farm App (which was, in fact, a tiny game based on timed actions)."
                }
            ]
        },
        
        {
            "role": "Junior Android Developer",
            "company": {
                "name": "Team Extension SRL",
                "url": "https://www.teamextension.ro",
                "period": "1 year",
                "logo": "tx-logo-small.png",
                "description": "<i>Ready to take your business to new heights? <br/><br/>Hire the best developers, engineers, programmers, coders, and consultants in Romania. <br/>Fortune 500 and start-ups choose Team Extension's developers for their mission critical software projects.</i>"
            },
            "projects": [
                {
                    "title": "Ivory Android",
                    "src": "https://codecanyon.net/item/ivory-shop-ecommerce-app/19807262?s_rank=3",
                    "preview": [
                        {
                            "src": "https://s3.envato.com/files/228262249/000.%20Cover%202.2.2.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/228262252/3.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/228262252/5.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/228262252/6.png"
                        }
                    ],
                    "description": "An Android app aiming to provide the user with a functional template that he/she could easily customize to suit whatever needs the user would have, representing the ordering client of a shop. <br/><br/>Once the user customized the theme used by the app, by adding a server for providing a valid communication channel, the app would handle all the requests and functions, without needing any code modifications. <br/><br/>The app was designed to support various payment methods, integrating PayPal and Stripe gateways, but also supporting custom card payment processing."
                }, 
                
                {
                    "title": "DeliveryAmp",
                    "src": "https://codecanyon.net/item/deliveryamp-android-app/20671581?s_rank=2",
                    "preview": [
                        {
                            "src": "https://s3.envato.com/files/234625834/1%20(1).jpg"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/234625836/Screenshot_20171002-171318.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/234625836/Screenshot_20171002-171615.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/234625836/Screenshot_20171002-171604.png"
                        },
                        
                        {
                            "src": "https://s3.envato.com/files/234625836/Screenshot_20171002-181512.jpg"
                        }
                    ],
                    "description": "This app was also aimed to become yet another template, mainly aimed for the users who are in search of an easily customizable app to handle deliveries for restaurants and fast-foods once a back-end system was linked to it. <br/><br/>Again the app was designed to support various payment methods, integrating PayPal and Stripe gateways, but also supporting custom card payment processing."
                }
            ]
        },
        
        {
            "role": "Junior Developer Lead",
            "company": {
                "name": "Team Extension SRL",
                "url": "https://www.teamextension.ro",
                "period": "11 months",
                "logo": "tx-logo-small.png",
                "description": "<i>Ready to take your business to new heights? <br/><br/>Hire the best developers, engineers, programmers, coders, and consultants in Romania. <br/>Fortune 500 and start-ups choose Team Extension's developers for their mission critical software projects.</i>"
            },
            "projects": []
        },
        
        {
            "role": "Junior Salesforce Developer",
            "company": {
                "name": "Team Extension SRL",
                "url": "https://www.teamextension.ro",
                "period": "7 months",
                "logo": "tx-logo-small.png",
                "description": "<i>Ready to take your business to new heights? <br/><br/>Hire the best developers, engineers, programmers, coders, and consultants in Romania. <br/>Fortune 500 and start-ups choose Team Extension's developers for their mission critical software projects.</i>"
            },
            "projects": [
                {
                    "title": "Nearby Contacts Component",
                    "src": "",
                    "preview": [
                        {
                            "src": "https://www.howtogeek.com/wp-content/uploads/2015/09/xmap.jpg.pagespeed.gp+jp+jw+pj+ws+js+rj+rp+rw+ri+cp+md.ic.UL1bzS8IOq.jpg"
                        }
                    ],
                    "description": "The component was aimed to provide the user with the list of Contacts located in its proximity. It was providing the user with quick navigation to the selected record's details page, and was able to smoothly pan to the selected Contact's location on map, displaying its full name above the related marker. <br/><br/>There were two versions of the developed app, one using an open-source library named <i>Leaflet.js</i>, while the other version running on <i>Google's API</i>. <br/><br/>This component was developed using the Lightning framework. For the Google API version, there was an extra Visualforce page, containing the actual representation of the map, created with the sole task of loading inside an <i>iFrame<i/> due to the LockerService's restrictions."
                }, 
                
                {
                    "title": "Partner Accounts Component",
                    "src": "",
                    "preview": [
                        {
                            "src": "assets/preview-not-available.png"
                        }
                    ],
                    "description": "This component was the one I was most pride of at that time. Also developed using the <i>Lightning</i> framework, its role was to provide users  with a full list of Accounts associated to a parent Account. <br/><br/>The component offered multiple features such as creating a new partnership between the parent Account and another Account accessible to the user, deleting existing relationships, and various navigation actions that were aimed to improve user's experience using the Salesforce platform."
                }
            ]
        }
    ],
    
    "contact": {
        "phone": "0761697372",
        "email": "a.birsasteanu@gmail.com",
        "facebook": "www.facebook.com/lexu.alex.378",
        "linkedin": "www.linkedin.com/in/bogdan-andrei-birsasteanu",
        "github": "www.github.com/LexuBBAA",
        "freelancer": "www.freelancer.com/u/abirsasteanu"
    }
}